import { CharacterReference } from "../character";
import { LevelTable, KeyOfLevelTable } from "../characterstatus/level";
import { clamp } from "../util/clamp";
import { keys, isInArray } from "../util/tuple";
import { TraitTable } from "../characterstatus/trait";


export const calcCharacterValue = (c: CharacterReference) => {
    const ret: [string, number][] = []

    const basePrice = 500
    const levelScale = levelPriceScale(c.レベル)
    const traitScale = traitPriceScale(c.特性)

}


const levelPriceTable = {
    Ｃ感覚: [0.02, 0.05, 0.09, 0.15, 0.2, 0.25, 0.35, 0.45, 0.6, 0.75],
    Ｐ感覚: [0.05, 0.09, 0.15, 0.2, 0.25, 0.35, 0.45, 0.6, 0.75, 0.95],
    Ｖ感覚: [0.05, 0.09, 0.15, 0.2, 0.25, 0.35, 0.45, 0.6, 0.75, 0.95],
    Ａ感覚: [0.05, 0.09, 0.15, 0.2, 0.25, 0.35, 0.45, 0.6, 0.75, 0.95],
    Ｂ感覚: [0.02, 0.05, 0.09, 0.15, 0.2, 0.25, 0.35, 0.45, 0.6, 0.75],
    Ｍ感覚: [0.02, 0.05, 0.09, 0.15, 0.2, 0.25, 0.35, 0.45, 0.6, 0.75],

    親密: [0.05, 0.1, 0.2, 0.35, 0.55, 0.75, 1, 1.25, 1.55, 2],
    従順: [0.05, 0.1, 0.2, 0.35, 0.55, 0.75, 1, 1.25, 1.55, 2],
    欲望: [0.05, 0.1, 0.2, 0.35, 0.55, 0.75, 1, 1.25, 1.55, 2],
    技巧: [0.05, 0.1, 0.2, 0.35, 0.55, 0.75, 1, 1.25, 1.55, 2],

    奉仕精神: [0.05, 0.05, 0.1, 0.1, 0.15, 0.2, 0.25, 0.3, 0.35, 0.45],
    露出癖: [0.05, 0.05, 0.15, 0.2, 0.25, 0.35, 0.45, 0.6, 0.75, 0.9],
    マゾっ気: [0.05, 0.1, 0.15, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8],
    サドっ気: [0.05, 0.05, 0.05, 0.3, 0.4, 0.45, 0.5, 0.6, 0.7, 0.75],

    自慰中毒: [0.05, 0.1, 0.15, 0.25, 0.35, 0.45, 0.6, 0.75, 0.9, 1.10],
    精液中毒: [0.1, 0.2, 0.3, 0.5, 0.7, 0.9, 1.2, 1.5, 1.8, 2.2],
    膣射中毒: [0.1, 0.2, 0.3, 0.5, 0.7, 0.9, 1.2, 1.5, 1.8, 2.2],
    肛射中毒: [0.1, 0.2, 0.3, 0.5, 0.7, 0.9, 1.2, 1.5, 1.8, 2.2],

    レズっ気: [0.05, 0.05, 0.1, 0.1, 0.15, 0.2, 0.25, 0.3, 0.35, 0.45],
    レズ中毒: [0.05, 0.1, 0.15, 0.25, 0.35, 0.45, 0.6, 0.75, 0.9, 1.1],
    ホモっ気: [0.05, 0.05, 0.1, 0.1, 0.15, 0.2, 0.25, 0.3, 0.35, 0.45],
    ゲイ中毒: [0.05, 0.1, 0.15, 0.25, 0.35, 0.45, 0.6, 0.75, 0.9, 1.1],
}

const levelPriceScale = (a: LevelTable) => {
    let scale = 1
    for (const k of keys(levelPriceTable)) {
        const o = levelPriceTable[k]
        const lv = a[k]
        scale += o[clamp(lv, 0, o.length - 1)]
    }
    return scale
}


const traitPriceTable = {
    処女: 1,
    再生処女: 0.2,

    恋慕: -0.5,
    親愛: -0.8,
    淫乱: 0.3,
    娼婦: 0.6,
    服従: 0.6,
    隷属: 1.2,

    臆病: -0.2,
    反抗的: 0.2,
    気丈: 0.4,
    素直: -0.2,
    大人しい: -0.2,
    プライド高い: 0.2,
    生意気: 0.2,
    プライド低い: -0.2,
    ツンデレ: 0.2,
    自制心: 0.2,
    無関心: -0.2,
    感情乏しい: -0.2,
    好奇心: 0.1,
    保守的: 0.1,
    一線超えない: 0.3,
    目立ちたがり: 0.1,
    貞操観念: 0.2,
    貞操無頓着: -0.2,
    解放: 0.1,
    恥じらい: 0.1,
    恥薄い: -0.1,
    痛みに弱い: -0.2,
    痛みに強い: 0.2,
    濡れやすい: 0.2,
    濡れにくい: -0.1,
    習得早い: 0.1,
    習得遅い: -0.1,
    舌使い: 0.3,
    薬毒耐性: 0.2,
    おもらし癖: 0.1,
    自慰しやすい: 0.1,
    汚臭鈍感: -0.2,
    汚臭敏感: 0.2,
    献身的: 0.3,
    快感に素直: -0.3,
    快感の否定: 0.3,
    即落ち: -2.5,

    倒錯的: 0.1,
    男嫌い: -0.1,
    妄信: 0.3,

    自慰狂い: 0.2,
    セックス狂: 0.3,
    尻穴狂い: 0.2,
    淫乳: 0.3,
    サド: 0.3,
    マゾ: 0.4,
    小悪魔: 0.2,
    女嫌い: -0.1,
    魅力: 0.2,
    謎の魅力: 1,

    Ｃ鈍感: -0.3,
    Ｃ敏感: 0.3,
    Ｂ鈍感: -0.3,
    Ｂ敏感: 0.3,
    Ｐ鈍感: -0.3,
    Ｐ敏感: 0.3,
    Ｖ鈍感: -0.3,
    Ｖ敏感: 0.3,
    Ａ鈍感: -0.3,
    Ａ敏感: 0.3,
    Ｍ鈍感: -0.3,
    Ｍ敏感: 0.3,

    貧乳: -0.1,
    絶壁: 0.1,
    巨乳: 0.2,
    爆乳: 0.1,
    回復早い: 0.2,
    回復遅い: -0.2,

    妖狐: 0.2,
    吸血鬼: 0.3,
    人気: 0.5,
    母乳体質: 0.2,
}


const traitPriceScale = (a: TraitTable) => {
    let scale = 1
    const traitKeys = keys(a)
    for (const k of keys(traitPriceTable)) {
        const o = traitPriceTable[k]
        if (isInArray(k, traitKeys)) {
            if (a[k]) {
                scale += traitPriceTable[k]
            }
        }
    }
    return scale
}

